#Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
#Каждое число вводится с новой строки.


A1 = int (input()) 
D = int (input()) 
N = int (input()) 
for i in range(N):
    print(A1+I*D) 
