#Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
s= int(input('Введите общее количество журавликов: '))
d=s//6
print(f'Петя и Серёжа сделали по {d} шт. журавликов, а Катя {d*2} ')
